SET FOREIGN_KEY_CHECKS = 0;
insert into film_actor (actor_id, film_id) values
(2,1001),
(3,1001),
(2,1002),
(5,1002),
(2,1003),
(4,1003),
(1,1004),
(2,1004),
(2,1005),
(4,1005),
(6,1006);
select*from film_actor;
insert into film (film_id, title, description, release_year, production_company) values
(1001, "초록물고기", "이창동감독의 데뷔작", "1997", "이스트필름"), 
(1002, "접속", "PC통신을 통해 신청자에게 접속하면서 생기는 로맨스", "1997", "명필름"), 
(1003, "8월의 크리스마스", "허진호감독의 데뷔작", "1998", "우노필름"), 
(1004, "쉬리", "국내 첩보 액션 스릴러 영화", "1999", "(주) 강제규필름"), 
(1005, "텔미썸딩", "이승현 감독의 멜로 영화", "1999", "쿠앤씨필름"), 
(1006, "시월애", "이승현 감독의 멜로 영화", "2000", "싸이더스"); 
select*from film;
insert into actor (actor_id, name, birth_date) values
(1,"송강호","1967-01-17"),
(2,"한석규","1964-11-03"),
(3,"문성근","1953-05-28"),
(4,"심은하","1972-09-23"),
(5,"전도연","1973-02-11"),
(6,"이정재","1981-10-30");
select*from actor;