"""
1. open 함수 : 모드 - w, a
Python에서 파일 쓰기를 위해서는 open() 함수를 사용하여 파일을 열고, write() 함수를 사용하여 파일에 내용을 씁니다.

아래는 간단한 예시입니다.
def write_to_file(filename, content):
    with open(filename, 'w') as f:
        f.write(content)
이 함수는 filename으로 지정한 파일을 쓰기 모드('w')로 열고, content 내용을 파일에 씁니다.

with 구문을 사용하면 파일을 자동으로 닫을 수 있습니다.

이 함수를 호출할 때 filename과 content 인자를 전달하여 파일 쓰기를 수행할 수 있습니다. 예를 들어, 다음과 같이 호출할 수 있습니다.

write_to_file('example.txt', 'This is an example.')
이 코드는 example.txt 파일을 생성하고, 파일에 This is an example. 내용을 씁니다.

2. write 함수 : 

3. close 함수 : 

"""
"""
컴퓨터 언어는 기계어(Machine Language)를 비롯하여, 어셈블리어(Assembly Language), 저수준 언어(Low-level Language), 고수준 언어(High-level Language)로 구분할 수 있습니다.

기계어는 컴퓨터가 이해할 수 있는 0과 1로 이루어진 이진 코드로 작성된 언어입니다. 기계어는 컴퓨터 하드웨어와 밀접한 관련이 있어서 이해하기가 어렵고 작성하기도 매우 복잡합니다.

어셈블리어는 기계어와 매우 유사한 형태의 언어입니다. 어셈블리어는 기계어보다는 이해하기 쉽고 작성하기도 상대적으로 쉽습니다. 그러나 어셈블리어는 여전히 하드웨어와 밀접한 관련이 있기 때문에 시스템 프로그래밍이나 임베디드 시스템 프로그래밍 등 특정 분야에서 주로 사용됩니다.

저수준 언어는 기계어와 어셈블리어와 비슷한 수준의 추상화 수준을 가진 언어입니다. C나 C++와 같은 저수준 언어는 메모리, CPU, 하드웨어 등과 밀접한 연관성이 있습니다. 저수준 언어를 사용하면 하드웨어와의 직접적인 상호작용이 가능해지므로, 특정 분야에서는 성능과 효율성이 필요한 경우에 사용됩니다.

고수준 언어는 컴퓨터의 하드웨어나 기계어와는 독립적인 추상화 수준을 가진 언어입니다. 예를 들어, Java, Python, C#, Ruby와 같은 고수준 언어는 코드의 가독성이 좋고, 개발자가 개발에 집중할 수 있도록 하여 생산성을 높일 수 있습니다. 고수준 언어는 각 언어별로 문법과 구조가 있으며, 이를 이용하여 프로그램을 작성합니다. 그러나 고수준 언어는 하드웨어와의 직접적인 상호작용이 불가능하며, 프로그램의 실행 시점에 하드웨어에 맞게 번역되어야 합니다.
"""
"""
인코딩, 디코딩, 부호화는 컴퓨터 과학과 정보 이론에서 중요한 개념입니다.

인코딩(Encoding)은 정보를 한 형식에서 다른 형식으로 변환하는 프로세스입니다. 예를 들어, 문자열을 ASCII 코드나 유니코드와 같은 숫자 형태로 인코딩하면, 컴퓨터가 이를 이해하고 저장할 수 있습니다. 또한, 데이터를 압축하거나 암호화하기 위해서도 인코딩을 사용합니다.

디코딩(Decoding)은 인코딩과 반대되는 프로세스로, 인코딩된 데이터를 다시 원래의 형태로 되돌리는 것입니다. 예를 들어, 인코딩된 ASCII 코드나 유니코드를 다시 문자열로 디코딩하는 것이 그 예입니다.

부호화(Encoding)는 인코딩과 유사한 개념으로, 정보를 특정한 규칙에 따라 바꾸는 것을 의미합니다. 예를 들어, 특정한 알고리즘을 사용하여 데이터를 암호화하면, 이를 부호화한 것이라고 할 수 있습니다. 또한, 부호화는 전송 중에 발생할 수 있는 오류를 감지하고 수정하는 데 사용되는 부호화 기술인 에러 검출 및 정정 부호화(Error Detection and Correction Encoding)도 있습니다.

요약하자면, 인코딩은 정보를 다른 형식으로 변환하고, 디코딩은 인코딩된 데이터를 원래의 형식으로 되돌리는 것이며, 부호화는 정보를 특정한 규칙에 따라 바꾸는 것을 말합니다. 이러한 개념들은 데이터 처리, 통신, 보안 등 다양한 분야에서 활용되고 있습니다.A
"""


#1.open 함수
# open("경로/파일명.확장자 or 파일명.확장자", "모드")
file = open("new.txt", "a")
# print("file", file)
#2.write 함수
file.write("\n\tHow are you?")


#3.close 함수
file.close
print("프로그램 종료")

