#매개변수가 2초과 할때 가변 매개 변수 "*args" 가변 매개변수이다.
#type은 tuple이에용
"""
가변 매개 변수(variable-length arguments)는 매개 변수의 개수가 가변적인 함수를 정의할 때 사용됩니다. 가변 매개 변수를 정의하려면, 매개 변수 이름 앞에 *를 붙입니다.

예를 들어, 다음과 같이 sum 함수를 정의할 수 있습니다.

def sum(*numbers):
    total = 0
    for number in numbers:
        total += number
    return total
이 함수는 매개 변수로 여러 개의 인자를 받을 수 있습니다. 예를 들어, sum(1, 2, 3)과 같이 함수를 호출하면, numbers 매개 변수는 (1, 2, 3) 튜플로 설정됩니다. 이 튜플의 모든 원소를 더하여 결과를 반환합니다.

가변 매개 변수를 사용하면, 매개 변수의 개수가 유동적인 함수를 정의할 수 있습니다. 예를 들어, 함수를 호출할 때 인자의 개수가 정해져 있지 않거나, 인자의 개수가 매번 다른 경우에 유용합니다.

참고로, 가변 매개 변수는 일반 매개 변수와 함께 사용할 수 있습니다. 가변 매개 변수는 반드시 일반 매개 변수 뒤에 정의되어야 합니다.

"""

def add(n1,n2, *args):
        result = n1+n2
        print("누적합>>", result + sum(args))
        
add(3,5,2,6)

#