"""
함수 내에서 함수 밖에 있는 변수를 사용 하지 못해용 

해결방법 
1번 함수 안에 지역 변수 넣기

2번 
global num 
함수 안에서 전역 변수로 선언하기 함수식이 끝나면 전연 변수를 해제해용

global은 파이썬에서 전역 변수를 선언하기 위해 사용되는 키워드입니다.

전역 변수는 함수 내에서 선언된 변수가 아니라, 모듈 수준에서 선언된 변수를 의미합니다. 따라서 함수 내에서 전역 변수에 접근하거나 수정하려면 global 키워드를 사용하여 전역 변수임을 명시해야 합니다.
"""
num = 1 #전역 변수 global variable
#함수 정의 

def increment():
    # num = 111 # 지역 변수
    # var = 66
    global num #전역 변수 선언햇어
    num = num +1
    print("함수 내에서 ", num)


#함수 호출
increment()
print("ー( ´ ▽ ` )ﾉ",num)

# print("지역 변수" , var)
print("전역 변수" , num)

