"""
함수 기준
변경이 가능 한 형태 mutable
변경이 불 가능 한 형태 immutable

함수 기준으로, 변경 가능한(mutable) 형태는 함수 내에서 값이 변경될 수 있는 형태를 의미합니다. 이러한 형태로는 리스트(list), 딕셔너리(dictionary), 집합(set) 등이 있습니다.

예를 들어, 리스트의 경우 append(), pop(), remove() 등의 메서드를 이용하여 리스트의 내용을 변경할 수 있습니다. 이때 함수 내부에서 리스트의 값을 변경하면, 해당 리스트는 변경된 상태로 함수 외부에서도 그대로 유지됩니다.

반면, 변경 불가능한(immutable) 형태는 함수 내에서 값이 변경될 수 없는 형태를 의미합니다. 이러한 형태로는 문자열(string), 튜플(tuple), 숫자(number) 등이 있습니다.

예를 들어, 문자열의 경우 문자열 내부의 한 문자를 변경하거나 삭제하는 것은 불가능합니다. 이때 함수 내부에서 문자열을 변경하려고 하면, 새로운 문자열 객체가 생성되어 해당 문자열을 변경한 후 그 결과를 반환합니다. 이는 함수 외부에서는 영향을 미치지 않습니다.
"""

lt = [2,4,6]
num =1
def change():
    lt[1] = 111
    global num
    num += 1
    print("함수 내 lt",lt)

change()
print("밖에 lt",lt)