# 입력 함수: input
# input()
#input(출력문구)
"""
input() 함수는 파이썬에서 사용자로부터 입력을 받을 때 사용하는 함수입니다. input() 함수는 콘솔 창에 메시지를 출력하고, 사용자가 키보드로 입력한 값을 문자열로 반환합니다.
기본 사용법은 아래와 같습니다.
name = input("이름을 입력하세요: ")
위 코드는 "이름을 입력하세요: "라는 메시지를 콘솔 창에 출력하고, 사용자가 키보드로 입력한 값을 문자열로 받아 변수 name에 저장합니다.

input() 함수로 입력받은 값은 항상 문자열로 반환됩니다. 따라서, 만약 입력받은 값을 숫자로 사용하고 싶다면, int() 함수 등을 이용하여 문자열을 숫자로 변환해야 합니다.

python
age = int(input("나이를 입력하세요: "))
위 코드는 "나이를 입력하세요: "라는 메시지를 콘솔 창에 출력하고, 사용자가 키보드로 입력한 값을 문자열로 받은 뒤, 이를 int() 함수를 이용하여 정수형으로 변환하여 변수 age에 저장합니다.

input() 함수는 보안과 관련된 이슈가 있을 수 있기 때문에, 반드시 안전하게 처리해야 합니다. 예를 들어, 입력받은 값이 원래 예상했던 데이터 형식과 일치하는지, 혹은 입력값에 대한 유효성 검사 등을 수행하여 보안에 대한 위험을 최소화해야 합니다.

자바에서 scanner 연속에서 받을 때, 스페이스, 엔터, 텝
"""


# 실수 입력 받기
# num = float(input("실수 입력햄 "))
# EVAL 함수 ()input() 함수는 사용자로부터 입력을 받을 때, 항상 문자열로 값을 반환합니다. 따라서, 입력받은 값이 숫자형 데이터일 경우, 이를 연산하기 위해서는 숫자형 데이터로 변환해야 합니다. 이때 eval() 함수 대신, int() 함수, float() 함수 등을 사용할 수 있습니다.
# num = eval(input("숫자 입력"))
# print(type(num))
# print("((•'ٮ'•)৴)",num)


# one = eval(input("숫자 2개 입력 쓰 "))
# print(type(one))
# print(one)

one, two = eval(input("숫자 2개 입력 쓰 "))
print(type(one))
print(type(two))
print("((•'ٮ'•)৴)",one)
print("((•'ٮ'•)৴)",two)